#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 
Warning: Attribute is deprecated

  with spectrocloud_cluster_azure.cluster,
  on cluster_azure-picard-1.tf line 18, in resource "spectrocloud_cluster_azure" "cluster":
  18:   cluster_profile_id = spectrocloud_cluster_profile.azure.id

Switch to cluster_profile

(and 3 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cluster_profile.azure: Refreshing state... [id=60994137dba160e4381dcbca]
spectrocloud_cluster_profile.prod-gcp: Refreshing state... [id=60994137dba160e4359d13d4]
spectrocloud_cluster_profile.prodvmware: Refreshing state... [id=60994137dba160e43b8ac08f]
spectrocloud_cluster_azure.cluster: Refreshing state... [id=609949e1dba160e84e5217ff]
spectrocloud_cluster_gcp.cluster: Refreshing state... [id=60c2720b48bda8dad841ad04]
spectrocloud_cluster_vsphere.prod-vmware-2: Refreshing state... [id=60c6f52673a43d5da5e6c2dc]
spectrocloud_cluster_vsphere.prod-vmware-1: Refreshing state... [id=60c6f52673a43d5da6ba3057]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # spectrocloud_cluster_profile.prodvmware has been changed
  ~ resource "spectrocloud_cluster_profile" "prodvmware" {
        id          = "60994137dba160e43b8ac08f"
        name        = "ProdVMware"
        # (3 unchanged attributes hidden)

      ~ pack {
            name   = "kubernetes"
          ~ tag    = "1.18.16" -> "1.19.x"
          ~ uid    = "60938c3552a198cad97c155b" -> "60a4e1cfec42bd5a916d46c0"
            # (2 unchanged attributes hidden)
        }
      ~ pack {
            name   = "sapp-hipster"
          ~ values = <<-EOT
                pack:
                  spectrocloud.com/install-priority: "10"
                manifests:
                  hipster:
                    # Liveness probe default itmeout
                    timeout: 60
                
                    # Disable Tracing
                    disableTracing: true
                
                    # The namespace to create the app in
                    namespace: "hipster-app"
              - 
            EOT
            # (3 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }
  # spectrocloud_cluster_vsphere.prod-vmware-1 has been deleted
  - resource "spectrocloud_cluster_vsphere" "prod-vmware-1" {
      - cloud_account_id   = "609946e4dba160e6c97aa130" -> null
      - cluster_profile_id = "60994137dba160e43b8ac08f" -> null
      - id                 = "60c6f52673a43d5da6ba3057" -> null
      - kubeconfig         = <<-EOT
            apiVersion: v1
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5ekNDQWJPZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EWXhOREEyTVRjeE5Wb1hEVE14TURZeE1qQTJNakl4TlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTWpVCnVEaUhDck9DaUtHMFcvR3dJaG9KOEoyWDNQcWpzczVRQllaMGRiYm92SG5TYVN4TjRYNjIwOXVTN0JNV3BxT0gKKzlXRVg3d2NLcXBST2dUeFlITGJ1VmQ2elYxRk9xVi92ckN4NDl0ZUlTeXJxMDhaSDlvY1o4cXo2cUZHdktKQwpzK2F1Mm1ETFplRktpT1JKdEZOYWZMdEg3RWFFSGp0bnhudUlJbnlHTUg1VDBOK25wa2ZEUWIvbnh4ZFduaFFOCjMyaEttZUJjdzN5WE16VWNMTGE1Rk9lMWtJajVqelFzWkZaV2Zpd3JnQnFVd05YZWlOeG5sUlp2U0t3RkhKMXAKYWpxUVJBazVUeU14aU9QeFRMNWx3TUpwR3hJN1FMenBEd0xrNXZiNmxsTnRTdjVMcFhkaXpldFBEQTJ3bW1GTQpDYXJPQ0hDWklTai9HVlBadFBzQ0F3RUFBYU1tTUNRd0RnWURWUjBQQVFIL0JBUURBZ0trTUJJR0ExVWRFd0VCCi93UUlNQVlCQWY4Q0FRQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBS1lUcUhNeXhQa2NpQk1rYy9vWklMSlkKRXIxVm9YSG0wMWdEWnpjektycGFLb3JSYXBKaXZLYWliUmRQMkRQS2lNMUZnQXVEMm00eVBLaDR6M3lFc20vKwp6VUJnTUdEOFFUUHVNbmlNNjl4L1pyN0NyVkdXb0V2RlZsQ3JLMmVCZENGTFJOWnNVK2p0Q3NqRVV5ZTByL1FBCjBVU3NudTE0MWRzeThRVHE3NWwvREVrUDdFbGh2b3VINW40UnN6VzI4ek5Nc3BmbklIaTgrT3BwcWFEK2pJR2cKSW5aWTdwMHlFQjRQdCsrR21sSFBvTUU0UGI4eGswcjFEMTdVNXlNZnNlMURscVEwTnZ0eWdReXNTbStKci8xQQpmK3hPY2M1djNpZEZ3ODFJRm9WSGxKMGdkTTFQWnpNVzBTcWF1TXpDWm1IUFJ5MXBadVBKR2NUc25qZk5EdHM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                server: https://vmware-prod-1-wrfp.spectrocloud.local:6443
              name: vmware-prod-1
            contexts:
            - context:
                cluster: vmware-prod-1
                user: vmware-prod-1-admin
              name: vmware-prod-1-admin@vmware-prod-1
            current-context: vmware-prod-1-admin@vmware-prod-1
            kind: Config
            preferences: {}
            users:
            - name: vmware-prod-1-admin
              user:
                client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4akNDQWRxZ0F3SUJBZ0lJZGhaTEs2Vm9rRW93RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TVRBMk1UUXdOakUzTVRWYUZ3MHlNakEyTVRRd05qSXlNVFphTURReApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1Sa3dGd1lEVlFRREV4QnJkV0psY201bGRHVnpMV0ZrCmJXbHVNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXhSTWJ1S2FqdnhibXVrWVcKMmNOb2JObWlIeE1ZMG1EaUdzN1kwVzQ5N29VQ3I2TmhuRHN4SmZmZkNOcFhSeWZ5dlhwd1liZWFuN1hDdy9ragpwQTdIcUgvcEtXTzBxOGtsUFc2YStlc2ViMk1YVE9jQnJaSUloQjU3VDlCQzdxWThQRmlvUWZxQ3FQcTYySjh5Cm82SWg0amhxbER2MU1BNk5IMC94dUNGbG1EZitoZjFiSmY2RlBoU1pnc1dOMDJDZ1ZGMGFac25KOUpGM1Q4OUwKYjhhOFJiNDd6Sm1iSk96b0dXOUJGQkZXYnN0NU1MQXFrUXFSZmNZLytqcnA1eE1iV1Vld083QmhYNXZaVndhQgo5WGNycUJHN2NKZ0xNWVJuNEQ4TXRFemNZRVNJZTRvdjRKZVJoZC83bDdhSnJPYlBjQ2V2Uk5NdTkwQTN6VW4vCmxsS215d0lEQVFBQm95Y3dKVEFPQmdOVkhROEJBZjhFQkFNQ0JhQXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFHQlN1QnJLS2czNmtNbGxGSzZHRFZXWEdKR2doN2pJelRCWApwcFZGRjJ5OHROdHZkMFd0M0lRdXc0MWNzWm1HaEVBaG51U1ltenFQMEJFL2R3b2pieE9SVnlXUjZGQUhNbllkCjRwZ2pzRUhLMlJ0bFpsV0ZhMk9DU20vTWNJWHlRamxUb0JHeVFIS0NqUmdxODRjQVpJSW9CcDY2NDkyV2RaWVIKMGlFYU9Qc0NwWWxyRlZzdWU4Wml3ZE42cXpLNGlsMEJtZmlodjEzWi9vK0NJN1ZhckRBczB4dklMaS9xVFVkdQpDeDYxWGVWb2ZOQTk0L2RyeXRacXhiNzA0NjcrTDJNZVMrUmpRQXRNYTFMc3I2WGpmUmZWaEkxeERXYTBab0p1CncxVXgrbUlCTHZSVGZMVG5zaUl0NUdEdEF5N3dkZ2RvdEYwUU1tY0FVUGpwK2V2djRxND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
                client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFb3dJQkFBS0NBUUVBeFJNYnVLYWp2eGJtdWtZVzJjTm9iTm1pSHhNWTBtRGlHczdZMFc0OTdvVUNyNk5oCm5Ec3hKZmZmQ05wWFJ5Znl2WHB3WWJlYW43WEN3L2tqcEE3SHFIL3BLV08wcThrbFBXNmErZXNlYjJNWFRPY0IKclpJSWhCNTdUOUJDN3FZOFBGaW9RZnFDcVBxNjJKOHlvNkloNGpocWxEdjFNQTZOSDAveHVDRmxtRGYraGYxYgpKZjZGUGhTWmdzV04wMkNnVkYwYVpzbko5SkYzVDg5TGI4YThSYjQ3ekptYkpPem9HVzlCRkJGV2JzdDVNTEFxCmtRcVJmY1kvK2pycDV4TWJXVWV3TzdCaFg1dlpWd2FCOVhjcnFCRzdjSmdMTVlSbjREOE10RXpjWUVTSWU0b3YKNEplUmhkLzdsN2FKck9iUGNDZXZSTk11OTBBM3pVbi9sbEtteXdJREFRQUJBb0lCQUJiZ3VQOGVtVE85dk5zeQo5OFFmNHlkL3ZFcFBOVHAyOU1pWDZxT2xZSnNuNWIvdC80N2JjRUV3SFR3eDNKL3VDMGZqeHRnUk1Hb0o5Nm80CmFlTEp0SFBqSlhZZ2xRQzhRUTU0b0pVU3JsM1A2d3lLWks5NW5ITjU5bWExam8rVnpMaFVzbk8yV1NTMHRxd2YKRHduZjhIOEtmWlRud1Bick9ZYkJDUmFQQ2ZRNWw2UHRzNVY4SDJuWFllS3pyZ2tMcDJ1ZFViYjQyK2VNQ2pCcApkWUJZeDVNamNmSll2bDRrZ3FhZjlpcGl2QldabFJaancxUTR6cUJYMUpMQ3pXekdMWFVzODdQbUwxK095a2M1ClRnb2JHWEw2aVJTMjNzMzMxbUdUQXlDZXVkTHBiL2ZvcVQ4NlZDTkFoSFBjUTJTOHg3UGFSclZ1MFJpeXBlbWgKUlpzSkJ3RUNnWUVBMWRXanhPZWJZMXVjNGEzdHI0eDBTYVdsRytOUHJoZWdkcXQ5U3o3TVl0MTVhRDJTMnhqcApwZ0cydWJkSEZMR2gwR2dLMW9uelVOdndObGJFMU9jbFlPbGJWZG5jZ2lrckNkTkl2YkpvWVNac3FHcld4NnZJClVmTXJkRXZ6RWQ2YlpGVWhGRDA0WFEyN0M1ckU4eTVpL0gvelBmQnVlZVJJbHNTZHlidGFyMXNDZ1lFQTYrOXUKRDg5OW5nekZZNEUwKzdxZVFmcTlkOFltU3pvVlNPZCt3YTJydjVGYWRhK0NBK3VjOEd3b25yUDZPV0g4V0V2NwphVXRUZEl3VlpyRHhHSU54Qko3elVvd0c2SERxc1NtMkRWM3dRTDdpMmZxNFF4Y2twNEt6RVNiZ0NPZE9EdGExCmhPVTBCWEZDQlJ0V2p6RkFZSUxZMVBDYlp3WjFZejdPc1VUT2NWRUNnWUFaQUwwQWRoQmVRc1VLUWxzTGJzSGUKSnFjeXBwYVhoWjIyb29Dby9yUEpUNW8xalJXUjFzempJMG9wVnZ2UnVKOXlEZWhPZzV6V3RKRFcyYmgwS0g3ZgpZUW5UOVFCcW04T3poMmYyL2xoa0c2a1MzRU0yMzZneHBOeE00ZUNQRTFkYUdQWWdOclJUZFJxTTFkRDNtbEhxCnNrOVB5OEF2TW5rbVgrRVBTSC9uQndLQmdRRGJ4SHpxOFVWN2tUM1VRQ2lRU3ZiYlVxcG1CUWJxajhILzFOSzMKcWdRUFAxL1p1NUFLQXRCL0N1Q1RZK1l5eVZqN0RsdXphdHpqOVJDQ1JWTnVtQkVRVXRjb0R4TG9OVFlIckdqTgo3ckM2UHBTa291dzhZalJjYkZ4TUg4QVR5eEZrdFE4RUtWUFp0ZlBmT2VYWkgvRnRkTFJ4TldZc0ExSVpEZ29PCkNaK2E0UUtCZ0Y4MW1OazdidEsrcjV4ajJwaHVTZlBpQXpTNzJLK09FRDdQR0dTdDhQazkzRHJTT2Z5NEhoWVEKR0lOZi94VHl0MFpKeXhUZ2lJY0NEcm05N2NBbEdiZTk2akt3TXRkaUpjTks0bjdjZWtQbjZmMUJSa1h3UW9hNgovcWRNOHoyd0NvR0lIM1Q2cFk0b2s3cUF3RStneEZwUWhmTGFFenVXV3dzd29sbFUxZEpDCi0tLS0tRU5EIFJTQSBQUklWQVRFIEtFWS0tLS0tCg==
        EOT -> null
      - name               = "vmware-prod-1" -> null

      - cloud_config {
          - datacenter            = "Datacenter" -> null
          - folder                = "Demo/spc-prod-vmware-1" -> null
          - network_search_domain = "spectrocloud.local" -> null
          - network_type          = "DDNS" -> null
          - ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT -> null
          - static_ip             = false -> null
        }

      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 1 -> null
          - name                    = "gpu-basic" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster2" -> null
              - datastore = "datastore55_2" -> null
              - id        = "60c6f52673a43d5daaf976f7" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 2 -> null
          - name                    = "general-compute" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster2" -> null
              - datastore = "datastore55_2" -> null
              - id        = "60c6f52673a43d5da864e81f" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 4 -> null
          - name                    = "worker-basic" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster2" -> null
              - datastore = "datastore55_2" -> null
              - id        = "60c6f52673a43d5dacd1c644" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = true -> null
          - control_plane_as_worker = true -> null
          - count                   = 3 -> null
          - name                    = "master-pool" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 2 -> null
              - disk_size_gb = 61 -> null
              - memory_mb    = 4096 -> null
            }

          - placement {
              - cluster   = "cluster2" -> null
              - datastore = "datastore55_2" -> null
              - id        = "60c6f52673a43d5dafd863a2" -> null
              - network   = "VM Network" -> null
            }
        }

      - pack {
          - name   = "lb-metallb" -> null
          - tag    = "0.8.x" -> null
          - values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.10-10.10.182.19
            EOT -> null
        }
    }
  # spectrocloud_cluster_vsphere.prod-vmware-2 has been deleted
  - resource "spectrocloud_cluster_vsphere" "prod-vmware-2" {
      - cloud_account_id   = "609946e4dba160e6c97aa130" -> null
      - cluster_profile_id = "60994137dba160e43b8ac08f" -> null
      - id                 = "60c6f52673a43d5da5e6c2dc" -> null
      - kubeconfig         = <<-EOT
            apiVersion: v1
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5ekNDQWJPZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EWXhOREEyTVRZek1Gb1hEVE14TURZeE1qQTJNakV6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTXV1CkJLcjJ1RFRPNlFlbE93WkNzR3htUGpjQ3hTZlVWU3QxNkw4NlNXL3BLRjJwUFBWZEF4bzh1MURlS2xvcEhuY2oKdkVxa3ZFTktHRHR1aU5pVWQ0cDQ5VHFkbERSZGs4T21kSnkzcE5IeW5DRlVoQTAyWitJQ3JldU1ZaWpJcEplYwpwdTIxZ2RPVjZIdFJUei92NFpFcVN6ZGdDd2hJU0ROYzVZUUd6SU9KZHYyeUFEZDdPdkN5KytncitjSldVQ1B1Cm5mK2ZVL0lFcU0xdUZvbk54VzVJRUQwakR5QTJDRW52MjloaS8wWU9POWxoRUw5SlJYaVhOVCtuT3MzMWxIZmsKd0JoNDl6VmlkdkYrU2FTaGUwN3JVRklxc3hoRzE4ZEFEdnRQWG9BWVpUNGtQSUswblNYS1hZQmgvY3NrZHVvUgppb01uNmZoaEdQV3p2QU9DYlVNQ0F3RUFBYU1tTUNRd0RnWURWUjBQQVFIL0JBUURBZ0trTUJJR0ExVWRFd0VCCi93UUlNQVlCQWY4Q0FRQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBQ0lIMi9abDJTL1ltWXlXcVk5WCtqNFUKdEFiaW02MmlXTHBvTTZsOEM4d1JvWDh5SEdNUmpvci9RR29jUWpjVlgxQ2tGUDdweWwzSjl2R0JucTY2OTYrbQpxcHEzR1lEMW5UeHh3dHk2ZlNuSHpwSVBrTWk3UHA3YzNqK2FrdXMvR3FjUTZoSTJlM3MreDVMZFIyakdqQ3dhCmYzbk9oMXFaSmJweDJWTHRWN3lUaDNMMmdHTGVZYWRRYXA2TXpyMzNDeUN1ZGQ3Wkl0NWZldUVLS3N4ck1oaVUKcTg2ZC9tREt6aldTUGlCend1bnM4a3J1Zng0Q1U2U25qaXVSSlRVdUh0OHdTQk1JYUpMejdyMVl6aUkzY2NISgpzNHVDdDlORDZhM1dpZVZ6YUlEUUpxeXZjVWYvSWtBRmtiRlRyY3g1eTRuNVBPZk1CaGUwWFZnb2RQVmFQUW89Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                server: https://vmware-prod-2-pf73.spectrocloud.local:6443
              name: vmware-prod-2
            contexts:
            - context:
                cluster: vmware-prod-2
                user: vmware-prod-2-admin
              name: vmware-prod-2-admin@vmware-prod-2
            current-context: vmware-prod-2-admin@vmware-prod-2
            kind: Config
            preferences: {}
            users:
            - name: vmware-prod-2-admin
              user:
                client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4akNDQWRxZ0F3SUJBZ0lJWWVXSkhhSGJzd2N3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TVRBMk1UUXdOakUyTXpCYUZ3MHlNakEyTVRRd05qSXhNekZhTURReApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1Sa3dGd1lEVlFRREV4QnJkV0psY201bGRHVnpMV0ZrCmJXbHVNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXhmZ3YyalJ6eU5hU0RwS28KalVtbVJnQnNzOVkycXBCdFJNTjVmMlg4dDdaSENudVdhL3VtTmUrVWtMNWxrcGx6K3RPNlQwQXhjMWZpelRjTgo5NVc3Y3ZXamhYSmVWQzU5ZWE5ZFZJME5CbW9hWDFlTlJ6ZnE1ZTJIVk9DN3Q5RDhzM2hVS1grWUcwZkY0RlF5CjJIZ2lOcVNPSW03SzNOblFtQXZodk8vRllxbU9NRnJaUmNLUi9KTFpPU3BZME01UDVmczBucnhQY1U4UlI1M3AKejR3eHpTQ1ZBaXE2YUNWWlRNdmZYMTczd0J4bVB3a1BxMlJoNHMvN1hjZHZpQTV5cmFEcFBPZkZpSWZ0cm9oKwp0QW1ad1l3MzRhOFhxNUlYbDZWUUVpWmczTUJWMnl5RDNhQVpWVDNaZEc1ajJiUThZSnQyZHVYaHVGK1hPMjdoCmJwSUNud0lEQVFBQm95Y3dKVEFPQmdOVkhROEJBZjhFQkFNQ0JhQXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFHaDFPdklYTnJJellxTW1COGV1WmJLbU05bFhxcjIyWEtVbAo0dXArQWxMYXdIMmdjeFllM3B0aEZFTm5nZ0RHSWxnalJwRFhNN2tjVmlkNHVDRkNZTURRa25mak5QZ1B6YXJsCnYxaGM0dGJLNjNsOUdxSkpTMDIzUjV2NUpoV0hyMThCTjdBaUVtMWxqN2xmWFN6VGRBSHN6QjM4U1pqcmpadXoKRytsRWdRb2hJNHl1VDRqblp3aDVYMjExMXkwR2xCcHpnKytybVg2bkJQZXYxWktqK25oZlZYSGxraUJIcDlGeApwVWpDTHIwbTRCd3BlR2VIZTRTQlZvbGcwRndHWlNQWFZxMWtqMGNWcUM2eENtYURYR240S3d5WmZaN2Ntck92Cjc2OWRvU2tDTk0ySTNzLzVWNnJBWCtGR3Vmc1VtQ2tHdll0RHFyRE1xVEhoTG56NXJCaz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
                client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBeGZndjJqUnp5TmFTRHBLb2pVbW1SZ0JzczlZMnFwQnRSTU41ZjJYOHQ3WkhDbnVXCmEvdW1OZStVa0w1bGtwbHordE82VDBBeGMxZml6VGNOOTVXN2N2V2poWEplVkM1OWVhOWRWSTBOQm1vYVgxZU4KUnpmcTVlMkhWT0M3dDlEOHMzaFVLWCtZRzBmRjRGUXkySGdpTnFTT0ltN0szTm5RbUF2aHZPL0ZZcW1PTUZyWgpSY0tSL0pMWk9TcFkwTTVQNWZzMG5yeFBjVThSUjUzcHo0d3h6U0NWQWlxNmFDVlpUTXZmWDE3M3dCeG1Qd2tQCnEyUmg0cy83WGNkdmlBNXlyYURwUE9mRmlJZnRyb2grdEFtWndZdzM0YThYcTVJWGw2VlFFaVpnM01CVjJ5eUQKM2FBWlZUM1pkRzVqMmJROFlKdDJkdVhodUYrWE8yN2hicElDbndJREFRQUJBb0lCQVFDcDNoM2hVK1NOemwraApGWUovU1ZUYzkveE9DMTc0MTlpS2lsZzBVcVNZVmxWNnp6VHhEd3M5ZUllMzgwZGdsVCtKV0NlalhPZVJtelhHCjlKaU5ldk5PM3lzaWxGSVFWWnZnei9KN1hGUnl6cFEyZnYrQXZxQldEb3h5N2lya3ZQUTRZdVdFZmpGY0p5ZkoKSnpaQnZFTlBNNytxRi9zRnFmaHNuclZoMHpOQlJjcm1tSzBuNTNGVk1aZUJKZzdDT0VjUHJmNklTa0tCRFBtZAo4MEZGQWFPblFadmRBV1R2aTRpUnVrWVhtNlM5a3JlOVFEc2FTVThWM1NIY0ZXenNnZ09IT2hJN3d6ZDZZMkgzCnh1QnlpSHh0d1FURU5ING1rcFl6eUYvZFhYN0dIaTBWZXY4clJaNythbVpTYWl4K2hORENuTG9YUkZCVEhIZWIKL09mZEc5RXhBb0dCQVAxNkJMei9ZSm91a2JsK3hOZXhONTNBa3ZaREtsWlFiTWJiL3Jjcks5VjlJNkp1N1o1eApuT0ZwbHU2R05KOTZFUGRxZjgyaUV0K2ZRV3lJdlU3YitLNEQ4WEFydHVWdmxBNHlUUFRieUh0STV6aStQRmw2CmY1bGN5T2c4eXlBOC8vaFBpVmZBTkUwMTVGdkUwSjZ5Ykk4bzNGUUtqNU9aM1p3cWtGQXVWSTBOQW9HQkFNZncKdFpFQlRUKzRnUFBMUlF2UTA4cmRxbU9hckF1MGxhY0h3L0xKOHFVRTk4Q3lPY3ViMk5ZQjRJZnFkenUrSVdmdAp6Vm5xZk5VWUdUNWl1UWtiK0VTNXVJamZ0WEhsQmlLNEV4eXdtVUlpTzdjZmVRaGh4NVdTcnZBUjViTVhhN1ptCm9EOHBOVTNJcndKVWpvcnhkdThUVWhMbVJxbzUzNG5heG42MFVadGJBb0dBQ3M1cTZVdlI2SURYd1pxLzlab2UKanVFbzRzcldRVHZJaDJuVm9DVjlCdXNBMitueXczQ0FpYk9ndGFhUEU4VjJkN1hZb1FHcDRGSy96VXEvRjErVgphSVhPZzBPNTFtbzlXNldWVmxNUVp3RWlxbTZoMEFiQzdkemd5OVhicXhJdXIzMWtrNU1rSjY2R2Y4c1NRZEhGCmd3enc1N3hUaHExbW4wUEpSMEhTWlBrQ2dZQUJYcXZQeDRPQStVR2c2ZmFhSXg4Z1Y2NXdLa0lkZm1vOEQ3aU8KOUVVK1RpOW9XWkE5emQ2SmNNL1ovb2c4bDR2aEMyY0p3NnFCUnozOUNHNGVHdHZ6bEpZb0VlaExWSGRiUzRtTgorOFBCQ1QwQmZ5eTBHdjlrRGZJMjROaURCcGtOVWR5dE1ob1VZMWlYbW42emd2MyttMUpIb041QkVrNXV3bG56CnlrWjQyd0tCZ1FEYUtMS0h3dC8xS21mWmRMUGdpb2F4U2JKR3JTQW9HYkE4NHU1UmJ1Z3NldWlWa2lacUZmKzAKQStEbkV1RGVtK2NBREpjSXJ0bW5qem50ZTN4c1JpSmxaVFpiNkJOWThtWU9VRXk5K1duTENKSEJmaDhSVWFHZgpPTHZiYlBFamZiZ2JzV1U1a1FHUzROZDErbXBsdU16Z0tiZ0dTWGdBeWcxNW5zbzRLWjM2TlE9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo=
        EOT -> null
      - name               = "vmware-prod-2" -> null

      - cloud_config {
          - datacenter            = "Datacenter" -> null
          - folder                = "Demo/spc-prod-vmware-2" -> null
          - network_search_domain = "spectrocloud.local" -> null
          - network_type          = "DDNS" -> null
          - ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT -> null
          - static_ip             = false -> null
        }

      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 1 -> null
          - name                    = "worker-basic" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster3" -> null
              - datastore = "datastore56_2" -> null
              - id        = "60c6f52673a43d5da9308bb4" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 2 -> null
          - name                    = "test-basic" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster3" -> null
              - datastore = "datastore56_2" -> null
              - id        = "60c6f52673a43d5dabd4f008" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = true -> null
          - control_plane_as_worker = true -> null
          - count                   = 1 -> null
          - name                    = "master-pool" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 2 -> null
              - disk_size_gb = 61 -> null
              - memory_mb    = 4096 -> null
            }

          - placement {
              - cluster   = "cluster3" -> null
              - datastore = "datastore56_2" -> null
              - id        = "60c6f52673a43d5da7bb8a78" -> null
              - network   = "VM Network" -> null
            }
        }

      - pack {
          - name   = "lb-metallb" -> null
          - tag    = "0.8.x" -> null
          - values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.20-10.10.182.29
            EOT -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # spectrocloud_cluster_profile.prodvmware will be updated in-place
  ~ resource "spectrocloud_cluster_profile" "prodvmware" {
        id          = "60994137dba160e43b8ac08f"
        name        = "ProdVMware"
        # (3 unchanged attributes hidden)

      ~ pack {
            name   = "kubernetes"
          ~ tag    = "1.19.x" -> "1.18.16"
          ~ uid    = "60a4e1cfec42bd5a916d46c0" -> "60938c3552a198cad97c155b"
            # (2 unchanged attributes hidden)
        }
        # (7 unchanged blocks hidden)
    }

  # spectrocloud_cluster_vsphere.prod-vmware-1 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-1" {
      + cloud_account_id   = "609946e4dba160e6c97aa130"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60994137dba160e43b8ac08f"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-1"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-1"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
          + static_ip             = false
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + name                    = "gpu-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "datastore55_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "general-compute"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "datastore55_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 4
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "datastore55_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 3
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "datastore55_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }

      + pack {
          + name   = "lb-metallb"
          + tag    = "0.8.x"
          + values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.10-10.10.182.19
            EOT
        }
    }

  # spectrocloud_cluster_vsphere.prod-vmware-2 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-2" {
      + cloud_account_id   = "609946e4dba160e6c97aa130"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60994137dba160e43b8ac08f"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-2"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-2"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
          + static_ip             = false
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster3"
              + datastore = "datastore56_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "test-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster3"
              + datastore = "datastore56_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster3"
              + datastore = "datastore56_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }

      + pack {
          + name   = "lb-metallb"
          + tag    = "0.8.x"
          + values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.20-10.10.182.29
            EOT
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Attribute is deprecated

  with spectrocloud_cluster_azure.cluster,
  on cluster_azure-picard-1.tf line 18, in resource "spectrocloud_cluster_azure" "cluster":
  18:   cluster_profile_id = spectrocloud_cluster_profile.azure.id

Switch to cluster_profile

(and 3 more similar warnings elsewhere)

Warning: Deprecated Attribute

  with spectrocloud_cluster_azure.cluster,
  on cluster_azure-picard-1.tf line 18, in resource "spectrocloud_cluster_azure" "cluster":
  18:   cluster_profile_id = spectrocloud_cluster_profile.azure.id

Switch to cluster_profile

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `sandbox`, Workflow: `Terraform Plan`*